app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
  @event = Event.all

SELECT "events".* FROM "events" WHERE (start_date <= '2019-07-11')
---
  def upcoming_events
	three_months = Date.today.next_month(3)
	today = Date.today
	@event = Event.where('start_date <= ? AND start_date >= ?', three_months, today)