app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("id", "ticket_type_id", "order_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id", 30], ["ticket_type_id", 18], ["order_id", 30], ["created_at", "2019-04-11 00:44:27.327192"], ["updated_at", "2019-04-11 00:44:27.327192"]]
---
  def create
	@ticket = Ticket.create(ticket_params)

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 30]]
---
  def destroy
	@ticket = Ticket.find(params[:id])
	@ticket.destroy()

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
---
  def update
	@ticket = Ticket.find(params[:id])

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  @ticket = Ticket.find(params[:id])

SELECT "tickets".* FROM "tickets"
---
  def index
  @ticket = Ticket.all