app/controllers/users_controller.rb

INSERT INTO "users" ("name", "lastname", "email", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
	@user = User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 12]]
---
  def destroy
	@user = User.find(params[:id])
	@user.destroy()

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "lastname" = ?, "email" = ?, "password" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Joaquin"], ["lastname", "Alonso"], ["email", "jalonso1@miuandes.cl"], ["password", "1234567"], ["address", "La capitania 282"], ["updated_at", "2019-04-10 19:19:05.983931"], ["id", 1]]
---
  def update
	@user = User.find(params[:id])
	@user.update(user_params)

SELECT COUNT("users"."id") AS count_id, "user_id" AS user_id FROM "users" INNER JOIN "orders" ON "orders"."user_id" = "users"."id" INNER JOIN "tickets" ON "tickets"."order_id" = "orders"."id" GROUP BY "user_id"
---
  def user_with_most_tickets
	a = User.joins(:orders => :tickets).group(:user_id).count(:id)